# Relationship Types

* Determine if each table is related to another table by one-to-one, one-to-many, or many-to-many relationships using pandas

In [3]:
import pandas as pd

dept_manager_df = pd.read_csv("../dept_manager.csv")

dept_manager_df.head()

  dept_no  emp_no   from_date     to_date
0    d001  110022  1985-01-01  1991-10-01
1    d001  110039  1991-10-01  9999-01-01
2    d002  110085  1985-01-01  1989-12-17
3    d002  110114  1989-12-17  9999-01-01
4    d003  110183  1985-01-01  1992-03-21

In [14]:
#determine the max number identical department numbers
print(max(dept_manager_df["dept_no"].value_counts()))

print("The 'dept_no' primary key in the 'departments' table has " +
      "a one-to-many relationship with the 'dept_no' foreign key in the 'dept_manager' table")

#determine the max number identical employee numbers
print(max(dept_manager_df["emp_no"].value_counts()))

print("The 'emp_no' primary key in the 'employees' table has " +
      "a one-to-one relationship with the 'emp_no' foreign key in the 'dept_manager' table")

4
The 'dept_no' primary key in the 'departments' table has a one-to-many relationship with the 'dept_no' foreign key in the 'dept_manager' table
1
The 'emp_no' primary key in the 'employees' table has a one-to-one relationship with the 'emp_no' foreign key in the 'dept_manager' table

## "dept_emp" Table Relationships

In [9]:
dept_employee_df = pd.read_csv("../dept_emp.csv")

dept_employee_df.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [47]:
#determine the max number identical department numbers
print(max(dept_employee_df["dept_no"].value_counts()))

print("The 'dept_no' primary key in the 'departments' table has " +
      "a one-to-many relationship with the 'dept_no' foreign key in the 'dept_emp' table")

#determine the max number identical employee numbers
print(max(dept_employee_df["emp_no"].value_counts()))

print("The 'emp_no' primary key in the 'employees' table has " +
      "a one-to-many relationship with the 'emp_no' foreign key in the 'dept_emp' table")

#need a composite key for the PK - determine if dept_no's are unique for duplicate employees, or if from_date's are unique for 
#duplicate employees - guess is that from_date's are unique (move up in same department)
duplicate_employees = dept_employee_df["emp_no"].value_counts()
duplicate_employees = duplicate_employees.loc[duplicate_employees > 1]
duplicate_employees = duplicate_employees.index
check_rows_df = dept_employee_df.loc[dept_employee_df["emp_no"].isin(duplicate_employees), :]
test_dept_unique = check_rows_df.groupby("emp_no").apply(lambda x: len(set(x)) == 1)
print("Are the department values different for each employee number? {}".format(not any(test_dept_unique)))

print("So we can make a composite key from employee number and dept number for this table, since the combinations of 'emp_no'"+ 
      " and 'dept_no' are unique")

85707
The 'dept_no' primary key in the 'departments' table has a one-to-many relationship with the 'dept_no' foreign key in the 'dept_emp' table
2
The 'emp_no' primary key in the 'employees' table has a one-to-many relationship with the 'emp_no' foreign key in the 'dept_emp' table
Are the department values different for each employee number? True
So we can make a composite key from employee number and dept number for this table, since the combinations of 'emp_no' and 'dept_no' are unique

## "employees" Table Relationships

In [20]:
employee_df = pd.read_csv("../employees.csv")

employee_df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [21]:
#determine the max number identical employee numbers
print(max(employee_df["emp_no"].value_counts()))

print("There are no duplicate employee numbers in the 'employees' table, so 'emp_no' can be used as a primary key")

1

## "salaries" Table Relationships

In [22]:
salaries_df = pd.read_csv("../salaries.csv")

salaries_df.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

In [24]:
#determine the max number identical employee numbers - in the emp_no column
print(max(salaries_df["emp_no"].value_counts()))

print("There are no duplicate employee numbers in the 'salaries' table, so 'emp_no' here has a one-to-one relationship with "+
     "the 'emp_no' primary key from the 'employees' table")

1
There are no duplicate employee numbers in the 'salaries' table, so 'emp_no' here has a one-to-one relationship with the 'emp_no' primary key from the 'employees' table

## "titles" Table Relationships

In [5]:
titles_df = pd.read_csv("../titles.csv")

titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [6]:
#determine the max number identical employee numbers - in the emp_no column
print(max(titles_df["emp_no"].value_counts()))

print("There are duplicate employee numbers in the 'titles' table, so 'emp_no' here has a many-to-one relationship with "+
     "the 'emp_no' primary key from the 'employees' table")

3
There are duplicate employee numbers in the 'titles' table, so 'emp_no' here has a many-to-one relationship with the 'emp_no' primary key from the 'employees' table

In [33]:
#remove date columns 
same_titles = titles_df.iloc[:, [0, 1]]

#remove all single entries (value counts of 1)
single_values = same_titles["emp_no"].value_counts()
single_values = single_values.loc[single_values > 1]
print(single_values)

#check single values vs. number of unique values from a groupby of employee number
#if the df's are equal, then no problem!
check_unique_titles = same_titles.loc[same_titles["emp_no"].isin(single_values.index)].groupby("emp_no").nunique()
check_unique_titles = check_unique_titles["title"]
if(single_values.equals(check_unique_titles)):
    print("The titles are all different for a given employee number!")
else:
    print("There are some duplicate titles")
    
print(check_unique_titles)

103876    3
467421    3
204120    3
105515    3
262553    3
         ..
22212     2
249527    2
251329    2
432918    2
74240     2
Name: emp_no, Length: 140270, dtype: int64
There are some duplicate titles
emp_no
10004     2
10005     2
10007     2
10009     3
10012     2
         ..
499988    2
499992    2
499996    2
499997    2
499998    2
Name: title, Length: 140270, dtype: int64

In [34]:
#check duplicate titles
irregularities = []
for num in single_values.index:
    if(single_values[num]!=check_unique_titles[num]):
        irregularities.append(num)
        
print(irregularities)

[110386, 110765]

In [37]:
#check the two irregularities
print(titles_df.loc[titles_df["emp_no"] == 110386])
titles_df.loc[titles_df["emp_no"] == 110765]

        emp_no             title   from_date     to_date
148152  110386           Manager  1992-08-02  1996-08-30
148153  110386  Technique Leader  1988-10-14  1992-08-02
148154  110386  Technique Leader  1996-08-30  9999-01-01

        emp_no             title   from_date     to_date
148163  110765           Manager  1989-05-06  1991-09-12
148164  110765  Technique Leader  1989-01-07  1989-05-06
148165  110765  Technique Leader  1991-09-12  9999-01-01

In [ ]:
#looks like we must add the "from_date" to the primary key in order to ensure the validity of the non-duplicate condition
#A title granted to the same employee twice on the same day is a duplicate entry, because you would just find the latter of the 
#"to_date" column values, and use that value to reduce the two columns to one column with all the data